//-------------------------------------------------Task 1----------------------------------------

/*document.querySelector('.wrapper').innerHTML = `
  <ol id="ol_lst">
    <li>Вивести завдання в документ.</li>
    <li>Модифікуйте код таблиці множення, створеної раніше, так, щоб<br>
        верхній рядок і лівий стовпчик були виведені підкресленим шрифтом,<br>
        тобто щоб вони сприймалися як заголовки. По контуру таблиця<br>
        повинна бути бузковим кольором, фон - коричневий, клітки - червоні.</li>
    <li>Виконати практичне завдання №1, при цьому організувати запит<br>
        необхідного місяця і року.</li>
    <li>Знайти кількість субот у вказаному місяці.</li>
    <li>Виконати практичне завдання №2.</li>
    <li>Протабулювати будь-які три функції для заданого діапазону<br>
        аргументу і вивести у вигляді таблиці, виділити позитивні числа<br>
        зеленим кольором.</li>
  </ol>
`;

//-------------------------------------------------Task 2----------------------------------------

document.write(`<table class="tbl">`);
document.write(`<tr><td></td>`);
for (i = 1; i <=10; i++) document.write(`<td class="t_td"><strong><ins>`+i+`</ins></strong></td>`);
document.write('</tr>');
for (i = 1; i <=10; i++)
{
document.write(`<tr><td class="t_td"><strong><ins>` + i + `</ins></strong></td>`);
for (j = 1; j <= 10; j++)
{
document.write(`<td class="t_td">` + (i*j) + `</td>`);}
document.write(`</tr>`);
}
document.write(`</table>`);*/
